{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing required Final Page button behavior and associated files/components.",
  "frontend-file-summaries.txt": "Text file listing high‑level summaries for all frontend pages and core components.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark modes, and global base styles.",
  "frontend/index.html": "Base HTML file loading the React app root and entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router and all 10 site routes wrapped in the LoveSiteLayout.",
  "frontend/src/components/animations/CelebrationHeartsOverlay.tsx": "Full‑screen celebration overlay showing animated heart graphics when enabled.",
  "frontend/src/components/animations/FloatingHeartsBackground.tsx": "Displays drifting floating heart emojis for decorative page backgrounds.",
  "frontend/src/components/animations/HeartAccents.tsx": "Renders small pulsing heart emojis around content for accent decoration.",
  "frontend/src/components/animations/PageFadeIn.tsx": "Simple wrapper applying fade‑in animation to page content.",
  "frontend/src/components/animations/SparklesOverlay.tsx": "Overlay rendering animated sparkle emojis across the screen.",
  "frontend/src/components/LoveSiteLayout.tsx": "Layout providing navigation header/footer, side menu, background pattern, and music controls.",
  "frontend/src/components/music/MusicControl.tsx": "UI buttons for play/pause and mute controls using the MusicProvider context.",
  "frontend/src/components/music/MusicProvider.tsx": "Context managing background music playback, mute state, and persistence via sessionStorage.",
  "frontend/src/components/RomanticButton.tsx": "Wrapper around UI Button adding custom romantic styling variants and animations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useRunawayButton.ts": "Implements logic for a button that moves away from the pointer within a container, updating its position based on mouse or touch proximity.",
  "frontend/src/index.css": "Defines global styles, custom color tokens, Tailwind layers, and utility classes for a romantic-themed UI.",
  "frontend/src/lib/lovePages.ts": "Stores metadata for sequential love‑themed pages and provides helpers to navigate between them.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/01-Home.tsx": "Displays the homepage with animated hearts, themed text, and a button that navigates to the first story page.",
  "frontend/src/pages/02-TheFirstMoment.tsx": "Renders a page describing the first meaningful moment, with sparkles and styled romantic text.",
  "frontend/src/pages/03-HowIFellForYou.tsx": "Shows a themed page explaining how the narrator fell in love, using soft gradients and styled text.",
  "frontend/src/pages/04-YourKindness.tsx": "Presents a page focused on praising the recipient’s kindness with romantic styling.",
  "frontend/src/pages/05-TheLittleThings.tsx": "Displays a page highlighting small beloved traits, including animated heart accents.",
  "frontend/src/pages/06-WhenIRealizedItWasLove.tsx": "Shows a page describing the moment the narrator realized their feelings were love.",
  "frontend/src/pages/07-WhatYouMeanToMe.tsx": "Renders a page expressing the emotional significance of the recipient with soft gradient visuals.",
  "frontend/src/pages/08-MyTrueConfession.tsx": "Romantic page displaying affectionate messages with pastel styling and fade‑in animation.",
  "frontend/src/pages/09-MyPromiseToYou.tsx": "Page presenting heartfelt promises with soft gradients and simple fade‑in layout.",
  "frontend/src/pages/10-FinalPage.tsx": "Interactive final page asking a question with Yes/Think/No buttons, state handling, and celebration animation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, animations, and plugins for the romantic theme.",
  "project_state.json": "Project metadata describing the 10‑page romantic site, features, requirements, and known issues."
}